# Python Intro - Final Exercise

In [215]:
import pyodbc
import pandas as pd
import numpy as np

In [216]:
### In windows, Using a ODBC DNS (predefined connection name)
conn = pyodbc.connect("DSN=College;"
                      "Server=DESKTOP-E6QQ4LT\SQLEXPRESS;"
                      "Database=College;"
                      "Trusted_Connection=yes;")

In [217]:
### Get the students table
students = pd.read_sql("SELECT * FROM Students;",conn) 
students.head(0)

Empty DataFrame
Columns: [Student_id, First_name, Last_name, Gender]
Index: []

In [218]:
departments = pd.read_sql("SELECT * FROM Departments;",conn)
departments.head(0)

Empty DataFrame
Columns: [Department_id, Department_name]
Index: []

In [219]:
courses = pd.read_sql("SELECT * FROM Courses;",conn)
courses.head(0)

Empty DataFrame
Columns: [Course_id, Course_name, Department_id, Teacher_id]
Index: []

In [220]:
classroom = pd.read_sql("SELECT * FROM Classroom;",conn)
classroom.head(0)

Empty DataFrame
Columns: [Course_id, Student_id, Degree]
Index: []

In [221]:
teachers = pd.read_sql("SELECT * FROM Teachers;",conn)
teachers.head(0)

Empty DataFrame
Columns: [Teacher_id, First_name, Last_name, Gender]
Index: []

# 1. Count the number of students on each department

In [246]:
#inner join classroom with courses
classroom_courses = pd.merge(classroom, 
                             courses[['Course_id', 'Course_name', 'Department_id']], 
                             on='Course_id')

#inner join classroom_courses with departments 
classroom_courses_departments = pd.merge(classroom_courses,
                                        departments[['Department_id', 'Department_name']],
                                        on='Department_id')

#counting the number of students in each department
classroom_courses_departments.groupby('Department_id').agg({'Student_id': pd.Series.nunique})

               Student_id
Department_id
1                      84
2                     200
3                     137
4                      81

# 2. How many students have each course of the English department and the total number of students in the department?

In [263]:
# selecting only the English department
english_dep = classroom_courses_departments.copy()
english_dep=english_dep[classroom_courses_departments.Department_id==1]
#counting the number of student in each course

english = english_dep.groupby(['Department_id','Course_name']).agg({'Student_id': [pd.Series.nunique]})
english.reset_index(inplace=True)
english.columns = ['Department_id','Course_name','TotalStudentInDepartment']
english.head()

   Department_id           Course_name  TotalStudentInDepartment
0              1      Advanced English                        24
1              1     English Begginers                        32
2              1  Proffesional English                        38

In [264]:

#counting total student in the english department
TotalStudent = english_dep.groupby('Department_id').agg({'Student_id': pd.Series.nunique})
TotalStudent.columns = ['TotalStudent']
TotalStudent

               TotalStudent
Department_id
1                        84

In [266]:

english.reset_index(inplace=True)
TotalStudent.reset_index(inplace=True)
TotalStudent_english = pd.merge(english,TotalStudent, on='Department_id')
TotalStudent_english.head()

,index,Department_id,Course_name,TotalStudentInDepartment,TotalStudent
0,0,1,Advanced English,24,84
1,1,1,English Begginers,32,84
2,2,1,Proffesional English,38,84

# 3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [226]:
#selecting the Science department and agg. the student in each course
science_class =  classroom_courses_departments[classroom_courses_departments.Department_id.isin([2])].\
groupby(['Department_id','Course_id']).\
agg({'Student_id':pd.Series.nunique }) 
science_class.columns=['TotalInClass']


#class size by categ
science_class_cat = science_class.copy()
science_class_cat['ClassSize'] = ''
science_class_cat.loc[(science_class_cat['TotalInClass']< 22),'ClassSize']='Small'
science_class_cat.loc[(science_class_cat['TotalInClass']> 21),'ClassSize']='Big'


#counting the number of each class size
science_class_cat.groupby('ClassSize').agg({'ClassSize':['count']})

          ClassSize
              count
ClassSize
Big              10
Small             6

# 4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

In [227]:
#counting the number of each gender 
students.groupby('Gender').agg({'Gender':['count']})

       Gender
        count
Gender
F         165
M         115

# 5. For which courses the percentage of male/female students is over 70%?

In [228]:
#join classroom_courses with students
courses_classroom_students = pd.merge(classroom_courses,
                            students[['Gender','Student_id']],
                            on='Student_id')

#agg of student gender per course
corse_gender = courses_classroom_students.copy()
corse_gender = corse_gender.groupby(['Course_name','Gender']).\
agg({'Student_id':pd.Series.nunique})
corse_gender.columns=['TotalGender']

#creating a new column containing the total per course
corse_gender['TotalInClass'] = corse_gender.groupby('Course_name').transform('sum')

#creating a new column containing the percentage
corse_gender['Ratio'] = corse_gender.TotalGender / corse_gender.TotalInClass

#selecting the >70% courses
corse_gender = corse_gender[corse_gender.Ratio>0.7]
corse_gender.head(10)

#presenting the %
corse_gender['Percent'] = corse_gender['Ratio']*100
corse_gender.head(10)

                    TotalGender  TotalInClass     Ratio    Percent
Course_name Gender
Genetics    F                26            37  0.702703  70.270270
Sculpture   F                17            23  0.739130  73.913043
Tenis       F                13            18  0.722222  72.222222

## Q6. For each department, how many students passed with a grades over 80?

In [229]:
#merge of class with courses
classroom_courses_degree = pd.merge(classroom, 
                             courses[['Course_id', 'Course_name', 'Department_id']], 
                             on='Course_id')

#selecting the student who have grade over 80
degree_80 = classroom_courses_degree[classroom_courses_degree.Degree>80]

#counting the student
degree_80 = degree_80.groupby('Department_id').agg({'Student_id':pd.Series.nunique})
degree_80.head()

               Student_id
Department_id
1                      40
2                     122
3                      61
4                      39

## Q7. For each department, how many students passed with a grades under 60?

In [230]:
#selecting the student who have grade under 60
degree_60 = classroom_courses_degree[classroom_courses_degree.Degree<60]

#counting the student
degree_60 = degree_60.groupby('Department_id').agg({'Student_id':pd.Series.nunique})


degree_60.head()

               Student_id
Department_id
1                       2
2                       7
3                       3
4                       1

# 8. Rate the teachers by their average student's grades (in descending order).

In [231]:
#shorter way of merging 3 tables
teacher_degree = pd.merge(pd.merge(teachers,courses, on='Teacher_id'),classroom, on='Course_id')
        
#calculting the avarage of each teacher
teacher_deg = teacher_degree.groupby(['Teacher_id','First_name','Last_name']).\
agg({'Degree':'mean'})

teacher_deg.reset_index(inplace=True)
teacher_deg.columns = ['Teacher_id','First_name','Last_name','Degree_mean']

#sort by degree(descending)
teacher_deg.sort_values(ascending=False,by='Degree_mean')

    Teacher_id  First_name   Last_name  Degree_mean
19          22      Darick        Hess    81.432703
2            3      Jordyn       Baron    80.729494
3            5     Heather     Metcalf    80.440242
17          20     Zachary       Healy    79.365867
0            1      Kaylea    Monzingo    79.365537
15          18      Daniel       Bland    78.908281
21          24      Keegan       Price    78.814631
12          15       Conor  Mckittrick    78.699492
20          23     Maxwell      Romkee    78.673509
16          19      Terran       Beaty    78.495479
14          17      Tanner  Fitzsimons    78.443395
7           10   Mackenzie       Olsen    78.383348
18          21      Ernest    Stoyanov    78.316150
4            6     Madison       Batan    77.743575
6            9    Katerina       Young    77.406852
9           12     Mikayla     Russell    77.134323
1            2      Amanda     Dworkin    76.899881
8           11     Kaitlin      Delude    76.765296
11          14     Jeffrey      Batzel    76.737973
13          16      Robert    Aivazian    76.516464
5            8    Caroline     Knuesel    75.955453
10          13   Alexander       Watts    75.668139

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

In [232]:
#merging the tables
df1_cour_dep = pd.merge(pd.merge(pd.merge(courses,
                       departments,
                       on='Department_id'),teachers,on='Teacher_id'),classroom,on='Course_id')

df1_cour_dep['Teachers_name'] = df1_cour_dep.First_name +' '+ df1_cour_dep.Last_name
#grouping by courses and counting the number of students in each course
df2_cour_dep = df1_cour_dep.copy()
df2_cour_dep = df2_cour_dep.groupby(['Course_name','Department_name','Teachers_name']).agg({'Student_id':'count'}) 
df2_cour_dep.reset_index(inplace=True)
df2_cour_dep.columns = ['Course_name','Department_name','Teachers_name','Sum_student_in_class']
df2_cour_dep.head()

        Course_name Department_name      Teachers_name  Sum_student_in_class
0  Advanced English         English   Conor Mckittrick                    24
1           Algebra         Science    Alexander Watts                    12
2           Biology         Science       Jordyn Baron                    36
3         Chemistry         Science     Jeffrey Batzel                    24
4  Computer Science         Science    Kaylea Monzingo                    38

# 10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).

In [233]:

df_student_course = pd.merge(pd.merge(pd.merge(students,\
                                                classroom,how='inner',on='Student_id'),\
                                       courses,how='inner',on='Course_id'),\
                              departments,how='inner',on='Department_id')


df1_student_course = df_student_course.copy()
df1_student_course = df1_student_course.groupby('Student_id').agg({'Degree':['mean']})
df1_student_course.reset_index(inplace=True)
df1_student_course.columns = ['Student_id','Total_degree']
df1_student_course.head()

df2_student_course = df_student_course.copy()
df2_student_course = df2_student_course.groupby(['Student_id','Department_name']).agg({'Degree':['mean']})
df2_student_course.reset_index(inplace=True)
df2_student_course.columns = ['Student_id','Department_name','Department_Avr']
df2_student_course.head()


df3_student_course = df_student_course.copy()
df3_student_course = df3_student_course.groupby(['Student_id','First_name','Last_name']).agg({'Course_name':['count']})
df3_student_course.reset_index(inplace=True)
df3_student_course.columns = ['Student_id','First_name','Last_name','Sum_courses']
df3_student_course.head()

   Student_id   First_name Last_name  Sum_courses
0           1   Alexandria    Heller            4
1           2       Cassie     Liska            5
2           3       Hayley     Frank            3
3           4      Maxwell     Kotch            3
4           5        Dylan     Boehm            3

In [280]:
df4_student_course = pd.merge(df1_student_course,df2_student_course,on='Student_id')
df4_student_course.head()
df4_student_course.reset_index(inplace=True)

df6_student_course = pd.merge(df4_student_course,df3_student_course)
#df6_student_course.head()


df6_student_course.pivot_table(index=['Student_id','First_name','Last_name'], columns=['Department_name'], values=['Total_degree','Sum_courses','Department_Avr'])

                                     Department_Avr                         \
Department_name                                Arts    English     Science
Student_id First_name  Last_name
1           Alexandria Heller             86.677535        NaN   79.557508
2           Cassie     Liska              79.542738        NaN   78.867115
3           Hayley     Frank                    NaN  83.972245   76.204427
4           Maxwell    Kotch              69.356144  70.929801   74.157066
5           Dylan      Boehm              64.494845        NaN  100.000000
6           Chelsea    Vuolo              68.799129        NaN   74.358535
7           Katrina    Evers                    NaN        NaN   73.325298
8           Sean       Hasenack           96.216926  89.073972   79.304200
9           Madalyn    Miller                   NaN        NaN   86.802830
10          Katrina    Miller             80.085031        NaN   78.642720
11          Rachael    Williams           70.931227        NaN   75.634056
12          Sophiya    Aponte             87.463154  83.145779   61.489085
13          Elijah     Hogan                    NaN        NaN   65.117226
15          Catherine  Sturgeon           62.078946        NaN   79.498041
16          Anina      Meneses            80.183240        NaN   82.269726
17          Cody       Dawkins                  NaN        NaN   77.610780
18          Austin     Power              71.874634  82.552181   83.802440
19          Devin      Tolstykh                 NaN        NaN   81.012028
20          Darby      Cobb               77.732135        NaN   88.540484
21          Kayla      Cameron            87.347722        NaN   72.290676
22          Alexandrea Hannafious               NaN  89.626782         NaN
23          Angela     Palermo            83.056965        NaN         NaN
24          Sarah      Reilly-Vessey      80.675826        NaN   83.082923
25          Morgan     Wikowsky                 NaN        NaN         NaN
26          Kyle       Shepler                  NaN  89.617024   86.392643
27          Shawn      Foster             96.208535        NaN   75.593857
28          Mycah      Bingham                  NaN  85.842696   76.112900
29          Chance     Mcdonough          89.448639        NaN   81.118440
30          Kyle       Nibbelink                NaN  75.846171   88.811482
31          Chanda     Fillmore                 NaN        NaN         NaN
...                                             ...        ...         ...
247         Michaela   Anderson           71.087956        NaN   82.392375
248         Wyatt      Yeros              60.838903        NaN   76.698833
249         Benjamin   Schott             71.987883        NaN   81.507984
250         Robin      Golbus                   NaN        NaN   84.065549
251         Heather    Williams           84.511338  80.464086   79.406817
252         Kori       Roper                    NaN        NaN   77.294996
253         Ruben      Mosher                   NaN  93.979918   84.355469
254         Victoria   Wert                     NaN        NaN   75.884974
255         Derrick    Mayberry                 NaN        NaN   78.112739
257         Nicholas   Roth               90.245913        NaN   86.460666
258         Christian  Boucher            80.377150  84.376073   90.447911
259         Taiahbeth  Gerard             78.695946        NaN         NaN
260         Samantha   Untiedt            74.231525        NaN   77.161046
262         Luke       Van Cleave               NaN        NaN         NaN
263         Kara       Sedlak             69.372437  76.478726   77.299487
265         Hannah     Anttila                  NaN        NaN   77.499552
266         Maria      Gaddis             55.272243        NaN         NaN
267         Catherine  Lemme                    NaN  80.612820   83.338550
268         Lauren     Salazar                  NaN        NaN   78.431908
269         Tyler      Raymond            74.542943        NaN   80.736405
270         Brooke     Bishop             72.487410        NaN   82.188336
271         Mckayla    Greaser                  NaN        NaN   85.886297
272         Jennifer   Smith              69.461506        NaN   89.663116
273         Kenneth    Lemmon                   NaN        NaN   73.334264
274         Samantha   Anderson                 NaN  72.569900         NaN
275         Elise      Ohler              94.702880  71.617451   80.897496
276         Dylan      Bannister                NaN        NaN   76.784735
277         Bryan      Medina             78.849330        NaN   81.298837
278         Sydney     Blas                     NaN        NaN   72.578017
280         Matthew    Mcgrath            77.237998        NaN   75.696576

                                                Sum_courses                  \
Department_name                           Sport        Arts English Science
Student_id First_name  Last_name
1           Alexandria Heller               NaN         4.0     NaN     4.0
2           Cassie     Liska                NaN         5.0     NaN     5.0
3           Hayley     Frank                NaN         NaN     3.0     3.0
4           Maxwell    Kotch                NaN         3.0     3.0     3.0
5           Dylan      Boehm          65.661106         3.0     NaN     3.0
6           Chelsea    Vuolo                NaN         2.0     NaN     2.0
7           Katrina    Evers                NaN         NaN     NaN     4.0
8           Sean       Hasenack             NaN         3.0     3.0     3.0
9           Madalyn    Miller               NaN         NaN     NaN     2.0
10          Katrina    Miller         85.120393         4.0     NaN     4.0
11          Rachael    Williams             NaN         3.0     NaN     3.0
12          Sophiya    Aponte               NaN         4.0     4.0     4.0
13          Elijah     Hogan          80.134422         NaN     NaN     2.0
15          Catherine  Sturgeon       67.795261         5.0     NaN     5.0
16          Anina      Meneses        78.507968         4.0     NaN     4.0
17          Cody       Dawkins              NaN         NaN     NaN     3.0
18          Austin     Power                NaN         4.0     4.0     4.0
19          Devin      Tolstykh             NaN         NaN     NaN     2.0
20          Darby      Cobb                 NaN         4.0     NaN     4.0
21          Kayla      Cameron        73.092297         5.0     NaN     5.0
22          Alexandrea Hannafious     85.638019         NaN     3.0     NaN
23          Angela     Palermo              NaN         2.0     NaN     NaN
24          Sarah      Reilly-Vessey        NaN         3.0     NaN     3.0
25          Morgan     Wikowsky       97.843102         NaN     NaN     NaN
26          Kyle       Shepler              NaN         NaN     4.0     4.0
27          Shawn      Foster               NaN         4.0     NaN     4.0
28          Mycah      Bingham              NaN         NaN     6.0     6.0
29          Chance     Mcdonough            NaN         4.0     NaN     4.0
30          Kyle       Nibbelink            NaN         NaN     3.0     3.0
31          Chanda     Fillmore       67.974169         NaN     NaN     NaN
...                                         ...         ...     ...     ...
247         Michaela   Anderson             NaN         3.0     NaN     3.0
248         Wyatt      Yeros                NaN         3.0     NaN     3.0
249         Benjamin   Schott         58.617007         7.0     NaN     7.0
250         Robin      Golbus         73.083079         NaN     NaN     2.0
251         Heather    Williams             NaN         4.0     4.0     4.0
252         Kori       Roper          72.426924         NaN     NaN     5.0
253         Ruben      Mosher               NaN         NaN     3.0     3.0
254         Victoria   Wert                 NaN         NaN     NaN     1.0
255         Derrick    Mayberry       74.077610         NaN     NaN     4.0
257         Nicholas   Roth                 NaN         5.0     NaN     5.0
258         Christian  Boucher              NaN         4.0     4.0     4.0
259         Taiahbeth  Gerard               NaN         1.0     NaN     NaN
260         Samantha   Untiedt              NaN         2.0     NaN     2.0
262         Luke       Van Cleave     78.336991         NaN     NaN     NaN
263         Kara       Sedlak               NaN         5.0     5.0     5.0
265         Hannah     Anttila              NaN         NaN     NaN     3.0
266         Maria      Gaddis         84.743844         2.0     NaN     NaN
267         Catherine  Lemme                NaN         NaN     4.0     4.0
268         Lauren     Salazar        81.308043         NaN     NaN     2.0
269         Tyler      Raymond              NaN         4.0     NaN     4.0
270         Brooke     Bishop               NaN         4.0     NaN     4.0
271         Mckayla    Greaser        91.040974         NaN     NaN     2.0
272         Jennifer   Smith          80.718437         3.0     NaN     3.0
273         Kenneth    Lemmon               NaN         NaN     NaN     3.0
274         Samantha   Anderson             NaN         NaN     1.0     NaN
275         Elise      Ohler                NaN         4.0     4.0     4.0
276         Dylan      Bannister            NaN         NaN     NaN     3.0
277         Bryan      Medina               NaN         6.0     NaN     6.0
278         Sydney     Blas           76.749775         NaN     NaN     3.0
280         Matthew    Mcgrath              NaN         5.0     NaN     5.0

                                           Total_degree                        \
Department_name                      Sport         Arts    English    Science
Student_id First_name  Last_name
1           Alexandria Heller          NaN    81.337515        NaN  81.337515
2           Cassie     Liska           NaN    79.137364        NaN  79.137364
3           Hayley     Frank           NaN          NaN  78.793700  78.793700
4           Maxwell    Kotch           NaN    71.481003  71.481003  71.481003
5           Dylan      Boehm           3.0    76.718650        NaN  76.718650
6           Chelsea    Vuolo           NaN    71.578832        NaN  71.578832
7           Katrina    Evers           NaN          NaN        NaN  73.325298
8           Sean       Hasenack        NaN    88.198366  88.198366  88.198366
9           Madalyn    Miller          NaN          NaN        NaN  86.802830
10          Katrina    Miller          4.0    80.622716        NaN  80.622716
11          Rachael    Williams        NaN    72.498837        NaN  72.498837
12          Sophiya    Aponte          NaN    78.810949  78.810949  78.810949
13          Elijah     Hogan           2.0          NaN        NaN  72.625824
15          Catherine  Sturgeon        5.0    71.333110        NaN  71.333110
16          Anina      Meneses         4.0    80.807665        NaN  80.807665
17          Cody       Dawkins         NaN          NaN        NaN  77.610780
18          Austin     Power           NaN    80.507924  80.507924  80.507924
19          Devin      Tolstykh        NaN          NaN        NaN  81.012028
20          Darby      Cobb            NaN    83.136309        NaN  83.136309
21          Kayla      Cameron         5.0    78.473818        NaN  78.473818
22          Alexandrea Hannafious      3.0          NaN  86.967607        NaN
23          Angela     Palermo         NaN    83.056965        NaN        NaN
24          Sarah      Reilly-Vessey   NaN    81.478192        NaN  81.478192
25          Morgan     Wikowsky        1.0          NaN        NaN        NaN
26          Kyle       Shepler         NaN          NaN  88.004833  88.004833
27          Shawn      Foster          NaN    80.747526        NaN  80.747526
28          Mycah      Bingham         NaN          NaN  77.734532  77.734532
29          Chance     Mcdonough       NaN    83.200990        NaN  83.200990
30          Kyle       Nibbelink       NaN          NaN  84.489712  84.489712
31          Chanda     Fillmore        1.0          NaN        NaN        NaN
...                                    ...          ...        ...        ...
247         Michaela   Anderson        NaN    74.856095        NaN  74.856095
248         Wyatt      Yeros           NaN    71.412190        NaN  71.412190
249         Benjamin   Schott          7.0    75.517816        NaN  75.517816
250         Robin      Golbus          2.0          NaN        NaN  78.574314
251         Heather    Williams        NaN    81.211582  81.211582  81.211582
252         Kori       Roper           5.0          NaN        NaN  76.321382
253         Ruben      Mosher          NaN          NaN  87.563619  87.563619
254         Victoria   Wert            NaN          NaN        NaN  75.884974
255         Derrick    Mayberry        4.0          NaN        NaN  77.103957
257         Nicholas   Roth            NaN    87.217715        NaN  87.217715
258         Christian  Boucher         NaN    86.412261  86.412261  86.412261
259         Taiahbeth  Gerard          NaN    78.695946        NaN        NaN
260         Samantha   Untiedt         NaN    75.696286        NaN  75.696286
262         Luke       Van Cleave      1.0          NaN        NaN        NaN
263         Kara       Sedlak          NaN    75.549925  75.549925  75.549925
265         Hannah     Anttila         NaN          NaN        NaN  77.499552
266         Maria      Gaddis          2.0    70.008043        NaN        NaN
267         Catherine  Lemme           NaN          NaN  82.657117  82.657117
268         Lauren     Salazar         2.0          NaN        NaN  79.869976
269         Tyler      Raymond         NaN    77.639674        NaN  77.639674
270         Brooke     Bishop          NaN    77.337873        NaN  77.337873
271         Mckayla    Greaser         2.0          NaN        NaN  88.463635
272         Jennifer   Smith           3.0    79.947686        NaN  79.947686
273         Kenneth    Lemmon          NaN          NaN        NaN  73.334264
274         Samantha   Anderson        NaN          NaN  72.569900        NaN
275         Elise      Ohler           NaN    82.028830  82.028830  82.028830
276         Dylan      Bannister       NaN          NaN        NaN  76.784735
277         Bryan      Medina          NaN    80.482335        NaN  80.482335
278         Sydney     Blas            3.0          NaN        NaN  75.359189
280         Matthew    Mcgrath         NaN    76.621429        NaN  76.621429


Department_name                           Sport
Student_id First_name  Last_name
1           Alexandria Heller               NaN
2           Cassie     Liska                NaN
3           Hayley     Frank                NaN
4           Maxwell    Kotch                NaN
5           Dylan      Boehm          76.718650
6           Chelsea    Vuolo                NaN
7           Katrina    Evers                NaN
8           Sean       Hasenack             NaN
9           Madalyn    Miller               NaN
10          Katrina    Miller         80.622716
11          Rachael    Williams             NaN
12          Sophiya    Aponte               NaN
13          Elijah     Hogan          72.625824
15          Catherine  Sturgeon       71.333110
16          Anina      Meneses        80.807665
17          Cody       Dawkins              NaN
18          Austin     Power                NaN
19          Devin      Tolstykh             NaN
20          Darby      Cobb                 NaN
21          Kayla      Cameron        78.473818
22          Alexandrea Hannafious     86.967607
23          Angela     Palermo              NaN
24          Sarah      Reilly-Vessey        NaN
25          Morgan     Wikowsky       97.843102
26          Kyle       Shepler              NaN
27          Shawn      Foster               NaN
28          Mycah      Bingham              NaN
29          Chance     Mcdonough            NaN
30          Kyle       Nibbelink            NaN
31          Chanda     Fillmore       67.974169
...                                         ...
247         Michaela   Anderson             NaN
248         Wyatt      Yeros                NaN
249         Benjamin   Schott         75.517816
250         Robin      Golbus         78.574314
251         Heather    Williams             NaN
252         Kori       Roper          76.321382
253         Ruben      Mosher               NaN
254         Victoria   Wert                 NaN
255         Derrick    Mayberry       77.103957
257         Nicholas   Roth                 NaN
258         Christian  Boucher              NaN
259         Taiahbeth  Gerard               NaN
260         Samantha   Untiedt              NaN
262         Luke       Van Cleave     78.336991
263         Kara       Sedlak               NaN
265         Hannah     Anttila              NaN
266         Maria      Gaddis         70.008043
267         Catherine  Lemme                NaN
268         Lauren     Salazar        79.869976
269         Tyler      Raymond              NaN
270         Brooke     Bishop               NaN
271         Mckayla    Greaser        88.463635
272         Jennifer   Smith          79.947686
273         Kenneth    Lemmon               NaN
274         Samantha   Anderson             NaN
275         Elise      Ohler                NaN
276         Dylan      Bannister            NaN
277         Bryan      Medina               NaN
278         Sydney     Blas           75.359189
280         Matthew    Mcgrath              NaN

[256 rows x 12 columns]

In [ ]:
היי תומאס ניסיתי להפוך את הטבלה מעמודות לשורות אבל לא הצלחתי. אשמח לעזרה